simulationCase/flowInPorousMedia/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     mpFoam;

startFrom       latestTime;

startTime       72000.0;

stopAt          endTime;

endTime         96000.0;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   1200;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxDeltaT       0.5;

maxCo           10.;
maxAlphaCo      1.;
maxAlphaDdt     2.3;
maxDi           5;

#includeIfPresent "statistics"

// ************************************************************************* //
