simulationCase/flowInPorousMedia/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-6;

vertices
(
    (0  0  0)
    (120 0  0)
    (120 30 0)
    (0  30 0)
    (0  0  30)
    (120 0  30)
    (120 30 30)
    (0  30 30)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 30 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
	        (2 6 5 1)
        );
    }
    sides
    {
        type symmetry;
        faces
        (
	        (1 5 4 0)
            (3 7 6 2)
			(4 5 6 7)
			(0 3 2 1)
        );
    }
);

// ************************************************************************* //
