simulationCase/flowInPorousMedia/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.solid     0
    volScalarFieldValue alpha.liquid    1
);

regions
(
    boxToCell
    {
        box (0 -0.001 0) (0.002 0.002 0.002);
        fieldValues
        (
            volScalarFieldValue alpha.solid     1.0
	        volScalarFieldValue alpha.liquid    0
	        volScalarFieldValue C               0 
        );
    }
);


// ************************************************************************* //
